Revit 2015 API
InstanceArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual void Insert(
	GeometryInstance item,
	int index
)
Visual Basic
Public Overridable Sub Insert ( _
	item As GeometryInstance, _
	index As Integer _
)
Visual C++
public:
virtual void Insert(
	GeometryInstance^ item,
	int index
)
Parameters
item
Type: Autodesk.Revit.DB.GeometryInstance
index
Type: System.Int32
See Also
InstanceArray Class
Autodesk.Revit.DB Namespace